robert-hh/micropython/ports/mimxrt/machine_sdcard.c
}

static uint32_t sdcard_cmd_app_cmd(USDHC_Type *base) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_APP_CMD,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = sdcard_transfer_blocking(base, NULL, &transfer, 250);
    sdcard_check_status(status, SDCARD_CMD_APP_CMD);
    sdcard_card_status(SDMMC_R1_CURRENT_STATE(command.response[0]));
    return command.response[0];
}

static uint32_t sdcard_cmd_sd_app_op_cond(USDHC_Type *base, uint32_t argument) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_ACMD_SD_SEND_OP_COND,
        .argument = argument,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR3,
    };

    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = sdcard_transfer_blocking(base, NULL, &transfer, 250);
    sdcard_check_status(status, SDCARD_ACMD_SD_SEND_OP_COND);
    return command.response[0];
}

static bool sdcard_cmd_all_send_cid(USDHC_Type *base, cid_t *cid) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_ALL_SEND_CID,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR2,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = sdcard_transfer_blocking(base, NULL, &transfer, 250);
    sdcard_check_status(status, SDCARD_CMD_ALL_SEND_CID);

    if (status == kStatus_Success) {
        cid->mdt = (uint16_t)((command.response[0] & 0xFFF00U) >> 8U);
        cid->psn = (uint32_t)(((command.response[1] & 0xFFFFFFU) << 8U) | ((command.response[0] & 0xFF000000U) >> 24U));
        cid->prv = (uint8_t)((command.response[1] & 0xFF000000U) >> 24U);
        cid->pnm[0] = (char)(command.response[2] & 0xFFU);
        cid->pnm[1] = (char)((command.response[2] & 0xFF00U) >> 8U);
        cid->pnm[2] = (char)((command.response[2] & 0xFF0000U) >> 16U);
        cid->pnm[3] = (char)((command.response[2] & 0xFF000000U) >> 24U);
        cid->pnm[4] = (char)(command.response[3] & 0xFFU);
        cid->pnm[5] = '\0';
        cid->oid = (uint16_t)((command.response[3] & 0xFFFF00U) >> 8U);
        cid->mid = (uint8_t)((command.response[3] & 0xFF000000U) >> 24U);
        return true;
    } else {
        return false;
    }
}

static bool sdcard_cmd_send_cid(USDHC_Type *base, const uint32_t rca, cid_t *cid) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SEND_CID,
        .argument = (rca << 16),
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR2,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = sdcard_transfer_blocking(base, NULL, &transfer, 250);
    sdcard_check_status(status, SDCARD_CMD_SEND_CID);

    if (status == kStatus_Success) {
        cid->mdt = (uint16_t)((command.response[0] & 0xFFF00U) >> 8U);
        cid->psn = (uint32_t)(((command.response[1] & 0xFFFFFFU) << 8U) | ((command.response[0] & 0xFF000000U) >> 24U));
        cid->prv = (uint8_t)((command.response[1] & 0xFF000000U) >> 24U);
        cid->pnm[0] = (char)(command.response[2] & 0xFFU);
        cid->pnm[1] = (char)((command.response[2] & 0xFF00U) >> 8U);
        cid->pnm[2] = (char)((command.response[2] & 0xFF0000U) >> 16U);
        cid->pnm[3] = (char)((command.response[2] & 0xFF000000U) >> 24U);
        cid->pnm[4] = (char)(command.response[3] & 0xFFU);
        cid->pnm[5] = '\0';
        cid->oid = (uint16_t)((command.response[3] & 0xFFFF00U) >> 8U);
        cid->mid = (uint8_t)((command.response[3] & 0xFF000000U) >> 24U);
        return true;
    } else {
        return false;
    }
}

static bool sdcard_cmd_set_rel_add(USDHC_Type *base, uint32_t *rca) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SEND_REL_ADDR,
        .argument = 0UL,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR6,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = sdcard_transfer_blocking(base, NULL, &transfer, 250);
    sdcard_check_status(status, SDCARD_CMD_SEND_REL_ADDR);

    if (status == kStatus_Success) {
        *rca = 0xFFFFFFFF & (command.response[0] >> 16);
        return true;
    } else {
        return false;
    }
}

static bool sdcard_cmd_send_csd(USDHC_Type *base, const uint32_t rca, csd_t *csd) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SEND_CSD,
        .argument = (rca << 16),
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR2,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = sdcard_transfer_blocking(base, NULL, &transfer, 250);
    sdcard_check_status(status, SDCARD_CMD_SEND_CSD);

    if (status == kStatus_Success) {
        csd->csd_structure = 0x3 & (command.response[3] >> 30);
        csd->taac = 0xFF & (command.response[3] >> 16);
        csd->nsac = 0xFF & (command.response[3] >> 8);
        csd->tran_speed = 0xFF & (command.response[3]);

        csd->ccc = 0xFFF & (command.response[2] >> 20);
        csd->read_bl_len = 0xF & (command.response[2] >> 16);
        csd->read_bl_partial = 0x1 & (command.response[2] >> 15);
        csd->write_blk_misalign = 0x1 & (command.response[2] >> 14);
        csd->read_blk_misalign = 0x1 & (command.response[2] >> 13);
        csd->dsr_imp = 0x1 & (command.response[2] >> 12);
        csd->c_size = (0x3FF & (command.response[2] << 2)) |
            (0x3 & (command.response[1] >> 30));

