robert-hh/micropython/ports/mimxrt/machine_sdcard.c
        csd->vdd_r_curr_min = 0x7 & (command.response[1] >> 27);
        csd->vdd_r_curr_max = 0x7 & (command.response[1] >> 24);
        csd->vdd_w_curr_min = 0x7 & (command.response[1] >> 21);
        csd->vdd_w_curr_max = 0x7 & (command.response[1] >> 18);
        csd->c_size_mult = 0x7 & (command.response[1] >> 15);
        csd->erase_blk_en = 0x1 & (command.response[1] >> 14);
        csd->sector_size = 0x7F & (command.response[1] >> 7);
        csd->wp_grp_size = 0x7F & (command.response[1]);

        csd->wr_grp_enable = 0x1 & (command.response[0] >> 31);
        csd->r2w_factor = 0x7 & (command.response[0] >> 26);
        csd->write_bl_len = 0xF & (command.response[0] >> 22);
        csd->write_bl_partial = 0x1 & (command.response[0] >> 21);
        csd->file_format_grp = 0x1 & (command.response[0] >> 15);
        csd->copy = 0x1 & (command.response[0] >> 14);
        csd->perm_write_protecct = 0x1 & (command.response[0] >> 13);
        csd->temp_write_protect = 0x1 & (command.response[0] >> 12);
        csd->file_format = 0x3 & (command.response[0] >> 10);

        return true;
    } else {
        return false;
    }
}

static bool sdcard_cmd_select_card(USDHC_Type *base, const uint32_t rca) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SELECT_CARD,
        .argument = (rca << 16),
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1b,
        .responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };
    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = sdcard_transfer_blocking(base, NULL, &transfer, 250);
    sdcard_check_status(status, SDCARD_CMD_SELECT_CARD);

    if (status == kStatus_Success) {
        sdcard_card_status(SDMMC_R1_CURRENT_STATE(command.response[0]));
        return true;
    } else {
        return false;
    }
}

static uint32_t sdcard_cmd_set_blocklen(USDHC_Type *base, uint32_t block_size) {
    status_t status;
    usdhc_command_t command = {
        .index = SDCARD_CMD_SET_BLOCKLENGTH,
        .argument = block_size,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1,
        .responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG,
    };
    usdhc_transfer_t transfer = {
        .data = NULL,
        .command = &command,
    };
    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);
    status = sdcard_transfer_blocking(base, NULL, &transfer, 250);
    sdcard_check_status(status, SDCARD_CMD_SET_BLOCKLENGTH);
    sdcard_card_status(SDMMC_R1_CURRENT_STATE(command.response[0]));
    return command.response[0];
}

static status_t sdcard_read(mimxrt_sdcard_obj_t *sdcard, uint8_t *buffer, uint32_t block_num, uint32_t block_count) {
    usdhc_data_t data = {
        .enableAutoCommand12 = true,
        .enableAutoCommand23 = false,
        .enableIgnoreError = false,
        .dataType = kUSDHC_TransferDataNormal,
        .blockSize = sdcard->block_len,
        .blockCount = block_count,
        .rxData = (uint32_t *)buffer,
        .txData = NULL,
    };

    usdhc_command_t command = {
        .index = (block_count == 1U) ? (uint32_t)SDCARD_CMD_READ_SINGLE_BLOCK : (uint32_t)SDCARD_CMD_READ_MULTIPLE_BLOCK,
        .argument = block_num,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1,
        .responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG,
    };

    usdhc_transfer_t transfer = {
        .data = &data,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);

    status_t status = sdcard_transfer_blocking(sdcard->sdcard, NULL, &transfer, 500);

    sdcard_check_status(status, command.index);
    sdcard_card_status(SDMMC_R1_CURRENT_STATE(command.response[0]));

    return status;
}

static status_t sdcard_write(mimxrt_sdcard_obj_t *sdcard, uint8_t *buffer, uint32_t block_num, uint32_t block_count) {
    usdhc_data_t data = {
        .enableAutoCommand12 = true,
        .enableAutoCommand23 = false,
        .enableIgnoreError = false,
        .dataType = kUSDHC_TransferDataNormal,
        .blockSize = sdcard->block_len,
        .blockCount = block_count,
        .rxData = NULL,
        .txData = (uint32_t *)buffer,
    };

    usdhc_command_t command = {
        .index = (block_count == 1U) ? (uint32_t)SDCARD_CMD_WRITE_SINGLE_BLOCK : (uint32_t)SDCARD_CMD_WRITE_MULTIPLE_BLOCK,
        .argument = block_num,
        .type = kCARD_CommandTypeNormal,
        .responseType = kCARD_ResponseTypeR1,
        .responseErrorFlags = SDMMC_R1_ALL_ERROR_FLAG,
    };

    usdhc_transfer_t transfer = {
        .data = &data,
        .command = &command,
    };

    mp_printf(&mp_plat_print, "CMD %d started\n", command.index);

    status_t status = sdcard_transfer_blocking(sdcard->sdcard, NULL, &transfer, 500);

    sdcard_check_status(status, command.index);
    sdcard_card_status(SDMMC_R1_CURRENT_STATE(command.response[0]));

    return status;
}

static void sdcard_print_cid(cid_t *cid) {
    mp_printf(&mp_plat_print, "\tManufacturer ID: %d\n", cid->mid);
    mp_printf(&mp_plat_print, "\tOEM/Application ID: %d\n", cid->oid);
    mp_printf(&mp_plat_print, "\tProduct name: %s\n", cid->pnm);
    mp_printf(&mp_plat_print, "\tProduct revision: 0x%02X\n", cid->prv);
    mp_printf(&mp_plat_print, "\tProduct serial number: 0x%08X\n", cid->psn);
    mp_printf(&mp_plat_print, "\tManufacturing date: %d.%d\n", (cid->mdt & 0xF), ((cid->mdt >> 4) & 0xFF) + 2000);
}

static void sdcard_print_csd(csd_t *csd) {
    mp_printf(&mp_plat_print, "\tFILE_FORMAT: 0x%08X\n", csd->file_format);
    mp_printf(&mp_plat_print, "\tTEMP_WRITE_PROTECT: 0x%08X\n", csd->temp_write_protect);
    mp_printf(&mp_plat_print, "\tPERM_WRITE_PROTECCT: 0x%08X\n", csd->perm_write_protecct);
    mp_printf(&mp_plat_print, "\tCOPY: 0x%08X\n", csd->copy);
    mp_printf(&mp_plat_print, "\tFILE_FORMAT_GRP: 0x%08X\n", csd->file_format_grp);
    mp_printf(&mp_plat_print, "\tWRITE_BL_PARTIAL: 0x%08X\n", csd->write_bl_partial);
    mp_printf(&mp_plat_print, "\tWRITE_BL_LEN: 0x%08X\n", csd->write_bl_len);
    mp_printf(&mp_plat_print, "\tR2W_FACTOR: 0x%08X\n", csd->r2w_factor);
    mp_printf(&mp_plat_print, "\tWR_GRP_ENABLE: 0x%08X\n", csd->wr_grp_enable);
    mp_printf(&mp_plat_print, "\tWP_GRP_SIZE: 0x%08X\n", csd->wp_grp_size);
    mp_printf(&mp_plat_print, "\tSECTOR_SIZE: 0x%08X\n", csd->sector_size);
    mp_printf(&mp_plat_print, "\tERASE_BLK_EN: 0x%08X\n", csd->erase_blk_en);
    mp_printf(&mp_plat_print, "\tC_SIZE_MULT: 0x%08X\n", csd->c_size_mult);
    mp_printf(&mp_plat_print, "\tVDD_W_CURR_MAX: 0x%08X\n", csd->vdd_w_curr_max);
    mp_printf(&mp_plat_print, "\tVDD_W_CURR_MIN: 0x%08X\n", csd->vdd_w_curr_min);
    mp_printf(&mp_plat_print, "\tVDD_R_CURR_MAX: 0x%08X\n", csd->vdd_r_curr_max);
    mp_printf(&mp_plat_print, "\tVDD_R_CURR_MIN: 0x%08X\n", csd->vdd_r_curr_min);
    mp_printf(&mp_plat_print, "\tC_SIZE: 0x%08X\n", csd->c_size);
    mp_printf(&mp_plat_print, "\tDSR_IMP: 0x%08X\n", csd->dsr_imp);
    mp_printf(&mp_plat_print, "\tREAD_BLK_MISALIGN: 0x%08X\n", csd->read_blk_misalign);
    mp_printf(&mp_plat_print, "\tWRITE_BLK_MISALIGN: 0x%08X\n", csd->write_blk_misalign);
    mp_printf(&mp_plat_print, "\tREAD_BL_PARTIAL: 0x%08X\n", csd->read_bl_partial);
    mp_printf(&mp_plat_print, "\tREAD_BL_LEN: 0x%08X\n", csd->read_bl_len);
    mp_printf(&mp_plat_print, "\tCCC: 0x%08X\n", csd->ccc);
    mp_printf(&mp_plat_print, "\tTRAN_SPEED: 0x%08X\n", csd->tran_speed);
    mp_printf(&mp_plat_print, "\tNSAC: 0x%08X\n", csd->nsac);
    mp_printf(&mp_plat_print, "\tTAAC: 0x%08X\n", csd->taac);
    mp_printf(&mp_plat_print, "\tCSD_STRUCTURE: 0x%08X\n", csd->csd_structure);
}

static bool sdcard_reset(USDHC_Type *base) {
    // TODO: Specify timeout
    return USDHC_Reset(base, (USDHC_SYS_CTRL_RSTA_MASK | USDHC_SYS_CTRL_RSTC_MASK | USDHC_SYS_CTRL_RSTD_MASK), 2048);
}

static bool sdcard_set_active(USDHC_Type *base) {
    // TODO: Specify timeout
    return USDHC_SetCardActive(base, 8192);
}

