robert-hh/micropython/ports/mimxrt/machine_sdcard.c
static bool sdcard_volt_validation(USDHC_Type *base) {
    bool valid_voltage = false;
    uint32_t count = 0UL;
    uint32_t response;

    // Perform voltage validation
    while ((count < SDMMC_MAX_VOLT_TRIAL) && (valid_voltage == false)) {
        sdcard_cmd_app_cmd(base);
        response = sdcard_cmd_sd_app_op_cond(base, (uint32_t)(SDMMC_VOLTAGE_WINDOW_SD | SDMMC_HIGH_CAPACITY | SD_SWITCH_1_8V_CAPACITY));

        /* Get operating voltage*/
        valid_voltage = (((response >> 31U) == 1U) ? true : false);
        count++;
    }

    if (count >= SDMMC_MAX_VOLT_TRIAL) {
        return false;
    } else {
        return true;
    }
}

static bool sdcard_power_on(mimxrt_sdcard_obj_t *self) {
    bool status = false;

    // Check if card is already initialized and powered on
    if (self->initialized) {
        return true;
    }

    // Start initialization process
    status = sdcard_reset(self->sdcard);
    if (!status) {
        return false;
    }

    status = sdcard_set_active(self->sdcard);
    if (!status) {
        return false;
    }

    status = sdcard_cmd_go_idle_state(self->sdcard);
    if (!status) {
        return false;
    }

    uint32_t oper_cond;
    status = sdcard_cmd_oper_cond(self->sdcard, &oper_cond);
    if (!status) {
        return false;
    }

    status = sdcard_volt_validation(self->sdcard);
    if (!status) {
        return false;
    }
    // Todo: evaluate operation conditions

    // ===
    // Ready State
    // ===
    cid_t cid_all;
    status = sdcard_cmd_all_send_cid(self->sdcard, &cid_all);
    if (!status) {
        return false;
    }
    sdcard_print_cid(&cid_all);
    // Todo: handle multiple cid receptions if multiple cards available

    // ===
    // Identification State
    // ===
    status = sdcard_cmd_set_rel_add(self->sdcard, &self->rca);
    if (!status) {
        return false;
    }
    mp_printf(&mp_plat_print, "RCA received - 0x%04X\n", self->rca);

    // ===
    // Standby State
    // ===
    uint32_t usdhc_clk = USDHC_SetSdClock(self->sdcard, CLOCK_GetSysPfdFreq(kCLOCK_Pfd2) / 3, 20000000UL);
    mp_printf(&mp_plat_print, "Actual USDHC clock: %dHz (%dHz)\n", usdhc_clk, 20000000UL);

    csd_t csd;
    status = sdcard_cmd_send_csd(self->sdcard, self->rca, &csd);
    if (!status) {
        return false;
    }
    decode_csd(self, &csd);
    sdcard_print_csd(&csd);

    cid_t cid;
    status = sdcard_cmd_send_cid(self->sdcard, self->rca, &cid);
    if (!status) {
        return false;
    }
    sdcard_print_cid(&cid);

    // ===
    // Transfer State
    // ===
    status = sdcard_cmd_select_card(self->sdcard, self->rca);
    if (!status) {
        return false;
    } else {
        self->initialized = true;
        return true;
    }
}

static bool sdcard_power_off(mimxrt_sdcard_obj_t *self) {
    return true;
}


STATIC int machine_sdcard_init_helper(mimxrt_sdcard_obj_t *self, const mp_arg_val_t *args) {
    if (self->initialized) {
        return 1;
    }

    // Initialize pins

    // TODO: Implement APi for pin.c to initialize a GPIO for an ALT function

    // GPIO_SD_B0_00 | ALT0 | USDHC1_DATA2 | SD1_D2    | DAT2
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_00_USDHC1_DATA2,0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_00_USDHC1_DATA2, 0x10B0u);

    // GPIO_SD_B0_01 | ALT0 | USDHC1_DATA3 | SD1_D3    | CD/DAT3
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_01_USDHC1_DATA3,0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_01_USDHC1_DATA3, 0x10B0u);

    // GPIO_SD_B0_02 | ALT0 | USDHC1_CMD   | SD1_CMD   | CMD
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_02_USDHC1_CMD,0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_02_USDHC1_CMD, 0x10B0u);

    // GPIO_SD_B0_03 | ALT0 | USDHC1_CLK   | SD1_CLK   | CLK
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_03_USDHC1_CLK,0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_03_USDHC1_CLK, 0x10B0u);

    // GPIO_SD_B0_04 | ALT0 | USDHC1_DATA0 | SD1_D0    | DAT0
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_04_USDHC1_DATA0,0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_04_USDHC1_DATA0, 0x10B0u);

    // GPIO_SD_B0_05 | ALT0 | USDHC1_DATA1 | SD1_D1    | DAT1
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_05_USDHC1_DATA1,0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_05_USDHC1_DATA1, 0x10B0u);

    // GPIO_SD_B0_06 | ALT0 | USDHC1_CD_B  | SD_CD_SW  | DETECT
    IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_06_USDHC1_CD_B,0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_06_USDHC1_CD_B, 0x10B0u);

    mp_printf(&mp_plat_print, "Current clock of PFD2: %dHz\n", CLOCK_GetSysPfdFreq(kCLOCK_Pfd2));
    mp_printf(&mp_plat_print, "USDHC1_CLK_ROOT: %dHz\n", CLOCK_GetSysPfdFreq(kCLOCK_Pfd2) / 3);


    // Initialize USDHC
    const usdhc_config_t config = {
        .endianMode = kUSDHC_EndianModeLittle,
        .dataTimeout = 0xFU,
        .readWatermarkLevel = 16U,  // Todo: Configure meaningfull watermark level
        .writeWatermarkLevel = 16U,  // Todo: Configure meaningfull watermark level
    };

    USDHC_Init(self->sdcard, &config);
    if (USDHC_DetectCardInsert(self->sdcard)) {
        uint32_t usdhc_clk = USDHC_SetSdClock(self->sdcard, CLOCK_GetSysPfdFreq(kCLOCK_Pfd2) / 3, 300000UL);
        USDHC_SetDataBusWidth(self->sdcard, kUSDHC_DataBusWidth1Bit);

        mp_printf(&mp_plat_print, "Actual USDHC clock: %dHz (%dHz)\n", usdhc_clk, 300000UL);
        self->inserted = true;
        return 1;
    } else {
        return -1;
    }
}

STATIC mp_obj_t sdcard_obj_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, all_args + n_args);

    // Parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, all_args, &kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Extract arguments
    mp_int_t sdcard_id = args[SDCARD_INIT_ARG_ID].u_int;

    if (!(1 <= sdcard_id && sdcard_id <= (sizeof(mimxrt_sdcard_objs) / sizeof(mimxrt_sdcard_obj_t)))) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError, "SDCard(%d) doesn't exist", sdcard_id));
    }

    mimxrt_sdcard_obj_t *self = &mimxrt_sdcard_objs[(sdcard_id - 1)];

    // Initialize SDCard Host
    if (machine_sdcard_init_helper(self, args)) {
        return MP_OBJ_FROM_PTR(self);
    } else {
        return MP_OBJ_NULL;
    }
}

// init()
STATIC mp_obj_t machine_sdcard_init(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    // Parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args) - 1];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Todo: make sure that there is a valid reason that a call to init would not change anything for an already initialized hsot
    machine_sdcard_init_helper(pos_args[0], args);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_sdcard_init_obj, 1, machine_sdcard_init);

// deinit()
STATIC mp_obj_t machine_sdcard_deinit(mp_obj_t self_in) {
    // TODO: Implement deinit function
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(machine_sdcard_deinit_obj, machine_sdcard_deinit);

// readblocks(block_num, buf, [offset])
STATIC mp_obj_t machine_sdcard_readblocks(mp_obj_t self_in, mp_obj_t _block_num, mp_obj_t _buf) {
    mp_buffer_info_t bufinfo;
    mimxrt_sdcard_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_get_buffer_raise(_buf, &bufinfo, MP_BUFFER_WRITE);
    // ---
    sdcard_cmd_set_blocklen(self->sdcard, SDMMC_DEFAULT_BLOCK_SIZE);
    status_t status = sdcard_read(self, bufinfo.buf, mp_obj_get_int(_block_num), bufinfo.len / SDMMC_DEFAULT_BLOCK_SIZE);
    // ---
    return MP_OBJ_NEW_SMALL_INT(status);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(machine_sdcard_readblocks_obj, machine_sdcard_readblocks);

// writeblocks(block_num, buf, [offset])
STATIC mp_obj_t machine_sdcard_writeblocks(mp_obj_t self_in, mp_obj_t _block_num, mp_obj_t _buf) {
    mp_buffer_info_t bufinfo;
    mimxrt_sdcard_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_get_buffer_raise(_buf, &bufinfo, MP_BUFFER_WRITE);
    // ---
    sdcard_cmd_set_blocklen(self->sdcard, SDMMC_DEFAULT_BLOCK_SIZE);
    status_t status = sdcard_write(self, bufinfo.buf, mp_obj_get_int(_block_num), bufinfo.len / SDMMC_DEFAULT_BLOCK_SIZE);
    // ---
    return MP_OBJ_NEW_SMALL_INT(status);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(machine_sdcard_writeblocks_obj, machine_sdcard_writeblocks);

